tap "homebrew/cask"
tap "homebrew/core"

# --------------------------
# CLI Tools
# --------------------------

brew "aom" # AV1 コーデック
brew "apr" # Apache Portable Runtime ライブラリ
brew "apr-util" # APR のユーティリティライブラリ
brew "argon2" # パスワードハッシュ関数
brew "aribb24" # ARIB 字幕デコーダー
brew "asdf" # マルチ言語バージョン管理ツール
brew "aspell" # スペルチェックツール
brew "autoconf" # ビルド構成ツール
brew "automake" # Makefile 自動生成ツール
brew "bdw-gc" # ガベージコレクションライブラリ
brew "boost" # C++ 標準ライブラリ拡張
brew "brotli" # 高速圧縮アルゴリズム
brew "c-ares" # 非同期 DNS クエリライブラリ
brew "ca-certificates" # SSL 証明書管理
brew "cairo" # 2D グラフィックライブラリ
brew "cask" # Cask パッケージ管理
brew "circleci" # CircleCI CLI
brew "cjson" # JSON パーサー
brew "cmocka" # C 言語向けユニットテストライブラリ
brew "composer" # PHP パッケージ管理
brew "coreutils" # GNU コマンドラインツール群
brew "curl" # HTTP クライアントツール
brew "dav1d" # AV1 デコーダー
brew "docbook" # XML ドキュメント処理
brew "docbook-xsl" # XML スタイルシート
brew "double-conversion" # 浮動小数点変換ライブラリ
brew "edencommon" # Meta (旧 Facebook) のライブラリ
brew "emacs" # テキストエディタ
brew "fb303" # Meta のモニタリングライブラリ
brew "fbthrift" # Meta の Thrift 実装
brew "ffmpeg" # 動画エンコーディングツール
brew "fizz" # Meta の TLS ライブラリ
brew "flac" # 無損失オーディオコーデック
brew "fmt" # C++ の文字列フォーマットライブラリ
brew "folly" # Meta の C++ ライブラリ
brew "fontconfig" # フォント管理ツール
brew "freetds" # ODBC SQL サーバークライアント
brew "freetype" # フォントレンダリングライブラリ
brew "frei0r" # 動画エフェクトプラグイン
brew "fribidi" # 双方向テキスト処理
brew "gd" # 画像処理ライブラリ
brew "gdbm" # データベースライブラリ
brew "gettext" # 国際化対応ツール
brew "gflags" # C++ のコマンドラインフラグ管理
brew "gh" # GitHub CLI
brew "ghq" # Git リポジトリ管理
brew "ghostscript" # PostScript 処理ツール
brew "giflib" # GIF 画像処理ライブラリ
brew "git" # バージョン管理ツール
brew "glib" # C 言語向けユーティリティライブラリ
brew "glog" # Google の C++ ロギングライブラリ
brew "gmp" # 多倍長整数演算ライブラリ
brew "gnu-getopt" # GNU getopt コマンド
brew "gnutls" # TLS/SSL ライブラリ
brew "go" # Go 言語コンパイラ
brew "gobject-introspection" # GObject のメタデータツール
brew "golangci-lint" # Go 言語用 Linter
brew "graphite2" # テキストレイアウトライブラリ
brew "harfbuzz" # テキストシェイピングエンジン
brew "icu4c" # Unicode 文字処理ライブラリ
brew "imagemagick" # 画像変換ツール
brew "jansson" # JSON 処理ライブラリ
brew "jemalloc" # メモリアロケータ
brew "jpeg" # JPEG 画像処理ライブラリ
brew "jpeg-turbo" # 高速 JPEG ライブラリ
brew "krb5" # Kerberos 認証ライブラリ
brew "libarchive" # アーカイブ操作ライブラリ
brew "libass" # 字幕処理ライブラリ
brew "libpq" # PostgreSQL クライアント
brew "libsodium" # 暗号ライブラリ
brew "libssh2" # SSH クライアントライブラリ
brew "libvpx" # VP8/VP9 ビデオコーデック
brew "openssl@3" # SSL/TLS ライブラリ
brew "pcre" # 正規表現ライブラリ
brew "peco" # インタラクティブフィルタ
brew "php" # PHP 言語
brew "pkg-config" # パッケージ管理ツール
brew "python@3.11" # Python 3.11
brew "sqlite" # 軽量データベース
brew "tig" # Git の TUI クライアント
brew "tree" # ディレクトリ構造表示
brew "watchman" # ファイル監視ツール
brew "webp" # WebP 画像処理ライブラリ
brew "xz" # 圧縮ツール
brew "zstd" # 高速圧縮ツール
brew "mise" 
brew "uv" 

# --------------------------
# GUI Applications (Cask)
# --------------------------

cask "raycast" # ランチャーアプリ
cask "google-chrome" # ウェブブラウザ
cask "google-japanese-ime" # 日本語入力
cask "iterm2" # ターミナルエミュレータ
cask "karabiner-elements" # キーボードカスタマイズツール
cask "obsidian" # Markdown ノートアプリ
cask "scroll-reverser" # スクロール方向カスタマイズ
cask "skitch" # 画像キャプチャ・注釈ツール
cask "slack" # チームチャット
cask "visual-studio-code" # コードエディタ
