tap "adoptopenjdk/openjdk"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "xz"
brew "glib"
brew "sqlite"
brew "cairo"
brew "unbound"
brew "gnutls"
brew "nghttp2"
brew "cask"
brew "circleci"
brew "composer"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "folly"
brew "gh"
brew "ghq"
brew "git"
brew "go"
brew "gobject-introspection"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "node"
brew "node-build"
brew "nodebrew"
brew "nodenv"
brew "openjdk"
brew "peco"
brew "postgresql@11"
brew "postgresql@12", restart_service: true
brew "postgresql@14"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "sbt"
brew "scala"
brew "telnet"
brew "tig"
brew "tree"
brew "watchman"
brew "yarn"
brew "heroku/brew/heroku"
cask "adoptopenjdk8"
cask "alfred"
cask "db-browser-for-sqlite"
cask "iterm2"
cask "java"
