cask_args appdir: "/Applications"

tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"


brew "cask"
brew "ghq"
brew "git"
brew "go"
brew "libheif"
brew "imagemagick"
brew "jq"
brew "node"
brew "node-build"
brew "peco"
brew "pyenv"
brew "ruby-build"
brew "rbenv"
brew "ruby"
brew "sbt"
brew "scala"
brew "telnet"
brew "tig"
brew "jq"
brew "tree"
brew "watch"
brew "wget"

cask 'docker'
cask "alfred"
cask "iterm2"
cask "visual-studio-code"
cask 'skitch'
