tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "xz"
brew "asdf"
brew "glib"
brew "cairo"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "circleci"
brew "composer"
brew "folly"
brew "harfbuzz"
brew "srt"
brew "ffmpeg"
brew "gh"
brew "ghq"
brew "gobject-introspection"
brew "libheif"
brew "imagemagick"
brew "krb5"
brew "nghttp2"
brew "peco"
brew "rename"
brew "ruby"
brew "ruby-build"
brew "telnet"
brew "tig"
brew "tree"
brew "watchman"
cask "visual-studio-code"
cask "google-chrome"
cask "obsidian"
cask "alfred"
cask "cheatsheet"
cask "fig"
cask "figma"
cask "skitch"
cask "slack"
cask "iterm2"
cask "spectacle"
cask "ticktick"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "Scroll Reverser"
