tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
brew "xz"
brew "asdf"
brew "glib"
brew "cairo"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "cask"
brew "ffmpeg"
brew "gh"
brew "ghq"
brew "imagemagick"
brew "peco"
brew "tree"
cask "visual-studio-code"
cask "google-chrome"
cask "cheatsheet"
cask "fig"
cask "figma"
cask "skitch"
cask "slack"
cask "iterm2"
cask "google-japanese-ime"
cask "karabiner-elements"
cask "Scroll Reverser"
